[
    {
      "title": "School Website",
      "description": "The ESFS School Website is a dynamic platform showcasing the school's programs,events, and achievements, created using WordPress. It offers a user-friendly interface, responsive design, and integrates various plugins for enhanced functionality.",
      "image": "images/esfs_Website.png"
    },
    {
      "title": "Learning Resource System",
      "description": "A Learning Resource System (LRS) is a web-based platform designed to facilitate learning interaction between educators and learners. It offers a centralized hub for uploading, organizing, and accessing learning materials, making it easy for students to access the materials.",
      "image": "images/lrs1.png"
    },
    {
      "title": "Monkey Hop Game",
      "description": "Monkey Hop is a simple fun game created using Unity, where players control a jumping monkey navigating through obstacles and collecting bananas until it reaches the final goal.", 
      "image": "images/gameDev1a.png"
    },
    {
      "title": "Space Shooter Game",
      "description": "Space Shooter is simple game where players will battle against alien spaceships. Players must defeat waves of enemy ships to survive. Every minute brings a challenge as boss ship emerges, testing the player's skills and tactics to the limit.", 
      "image": "images/gameDev2a.png"
    },
    {
      "title": "Task Tracker Web-App",
      "description": "Task Tracker is a simple web-based application designed for task organization and tracking. Users can create an account, providing them with access to a personalized workspace. Within this workspace, users can add new tasks, specifying details such as task name, description, due date, and priority level.", 
      "image": "images/to-dolist1.png"
    },
    {
      "title": "Password Verifier",
      "description": "Password verifier is a mini web-based application that assesses the strength of passwords entered by users to determine if they meet security standards. The system provides immediate feedback to users, indicating whether their password is considered strong or not.", 
      "image": "images/pv1.png"
    },
    {
      "title": "Porfolio Mobile Design",
      "description": "A mobile prototype version of my portfolio, created using Figma to simulate real-user interaction and test responsiveness on mobile devices.", 
      "image": "images/Portfolio.png"
    },
    {
      "title": "Landing Page (Concept Design)",
      "description": "This concept design prototype features a clean, simple layout that guides the viewer’s attention with a clear visual hierarchy. It focuses purely on layout and content structure, with no interactive elements included.", 
      "image": "images/Portfolio1.png"
    }
  ]
  